// کتابخانه i/o => input/output
#include <iostream>

// کتابخانه برای پشتیبانی متن فارسی در ویندوز 
#include <windows.h>

// کتابخانه standard برای ساده سازی استفاد از std
using namespace std ;

// تابع اصلی / خروجی یک عدد است
int main (){
    // تنظیم کد صفحه برای UTF-8
    SetConsoleOutputCP(65001);
    
    //ساخت متغییر 
    // user_money => پول کاربر
    // rate => نرخ دلار
    // chenage => مقدار توان خرید دلار با نرخ وارد شده
    float user_money , rate ,chenage;   
    // راهنمایی کاربر 
    cout << "مقدار تومان را وارد کنید: ";
    // دریافت مقدار پول کاربر
    cin >> user_money;
    // مقدار پول نباید منفی باشد
    if (user_money> 0) {
        // راهنمایی کاربر
        cout << "نرخ دلار را وارد کنید: ";
        // دریافت نرخ دلار
        cin >> rate;
        // نرخ نباید کمتر از صفر باشد
        if (rate > 0 ) {
            // تقسیم پول کاربر بر نرخ وارد شده
            chenage = user_money / rate;
            // نمایش خروجی 
            cout << "شما با مقدار پول " << user_money << " میتوانید " << chenage << " دلار با نرخ" << rate << " خریداری کنید";
        }else {
            // شرط برای اینکه اگر نرخ وارد شده کمتر از یک بود
            "مقدار نرخ وارد شده نیمتواند صفر و یا کمتر از صفر باشد.";
        }
        
        // شرط برای اینکه اگر پول کاربر صفر تومان بود
    }else if (user_money == 0) {
        cout << "مقدار وارد شده صفر است و صفر قابل چنج نیست.";
    }else {
        // شرط اینکه مقدار پول کاربر کمتر از صفر بود
    cout << "مقدار پول وارد شده نمیتواند کتر از صفر باشد";
    }
    return 0;
}


// ساخته شده توسط 
// instagram = Ghasem_slp
// GitHub = Ghasemslp
