// کتابخانه i/o => input/output
#include <iostream>

// کتابخانه برای پشتیبانی متن فارسی در ویندوز 
#include <windows.h>


// کتابخانه standard برای ساده سازی استفاد از std
using namespace std ;

// تابع اصلی / خروجی یک عدد است
int main (){

    // تنظیم کد صفحه برای UTF-8
    SetConsoleOutputCP(65001);

    // (تعریف متغییر (ساخت ظرف برای قرار دادن محتوا درون آن
    int user_input , remainder ;

    // راهنمایی کاربر برای دادن ورودی
    cout << "یک عدد  بزرگتر از 0 وارد کنید : ";
    //  دریافت ورودی و قرار دادن در ظرف user_input
    cin >> user_input;
    // تعریف شرط برای اینکه اگر عدد وارد شده کاربر کوچکتر یا خوده صفر بود و اگر بالای 0 بود
    if(user_input > 0){
        // محاسبه باقی مانده عدد دریافت شده بر عدد 2 
        remainder = user_input % 2;
        // اگر صفر شد یعنی عدد زوج و اگر صفر نبود یعنی عدد فرد است
        if (remainder != 0) {
            // نمایش خروجی به کاربر
            cout << "عدد شما فرد است و باقی مانده "<< remainder <<" شده است.";
        }else {
            // نمایش خروجی به کاربر
            cout << "عدد شما زوج است و باقی مانده "<< remainder <<" شده است.";
        }
    }else {
        // نمایش پیام  برای عدد وارد شده کاربر در صورتی که کمتر از یک بود
        cout << "عدد وارد شده اشتباه است.";
    }
    // اگر در محسابات بالا خروجی به صورت عدد نبود return 0 از ارور تابع جلوگیری میکند
    return 0;
}

// ساخته شده توسط 
// instagram = Ghasem_slp
// GitHub = Ghasemslp
