// کتابخانه i/o => input/output
#include <iostream>

// کتابخانه برای پشتیبانی متن فارسی در ویندوز 
#include <ostream>
#include <windows.h>

// کتابخانه standard برای ساده سازی استفاد از std
using namespace std ;

// تابع اصلی / خروجی یک عدد است
int main (){

    // تنظیم کد صفحه برای UTF-8
    SetConsoleOutputCP(65001);

    int user_input_1 , user_input_2 , remainder;
    // راهنمایی کاربر برای دادن ورودی
    cout << "یک عدد  بزرگتر از 0 وارد کنید : ";
    //  دریافت ورودی و قرار دادن در ظرف user_input_1
    cin >> user_input_1;
    // تعریف شرط برای اینکه اگر عدد وارد شده کاربر کوچکتر یا خوده صفر بود و اگر بالای 0 بود
    if(user_input_1 > 0){
        
        // راهنمایی کاربر برای دادن ورودی
        cout <<"یک عدد  برای تقسیم وارد کنید : ";
        //  دریافت ورودی و قرار دادن در ظرف user_input_2
        cin >> user_input_2;
        // اگر عدد دوم بزرگتر از صفر بود انجام محاسبات
        if (user_input_2 > 0) {
            // محاسبه باقی مانده عدد دریافت شده اول بر عدد دوم
            remainder = user_input_1 % user_input_2;
            
            // اگر صفر شد یعنی باقی مانده زوج و اگر صفر نبود یعنی باقی مانده فرد است
            if (remainder != 0) {
                // نمایش خروجی به کاربر
                cout << " باقی مانده عدد شما فرد است . باقی مانده => "<< remainder <<" شده است.";
            }else {
                // نمایش خروجی به کاربر
                cout << " باقی مانده عدد شما زوج است . باقی مانده => "<< remainder <<" شده است.";
            }}
        else {
            // اگر 0 و یا کمتر از صفر بود خطا بده و برنامه رو ببند
            cout << "عدد نمی تواند صفر و یا منفی باشد!";
            }} 
    else {
        // نمایش پیام ارور برای عدد وارد شده کاربر در صورتی که کمتر از یک بود
        cout << "عدد وارد شده اشتباه است.";
    }
    // اگر در محسابات بالا خروجی به صورت عدد نبود return 0 از ارور تابع جلوگیری میکند
    return 0;
}


// ساخته شده توسط 
// instagram = Ghasem_slp
// GitHub = Ghasemslp
